SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( #80105
comment ( By Paul Mitchell )
 comment ( Copyright 2008 )
 Type ( Engine )
 WagonShape ( 80105.s )
 
 Size ( 2.8005m 3.95569m 13.6636m )
 CentreOfGravity ( 0.0m 0.0m 0.0m )
 Centre ( 0m 1.96962m -0.0256031m )
 Mass ( 88.3t )
 InertiaTensor ( Box(2.8005m 3.95569m 13.6636m) )
 Coupling (
 Type ( Chain )
 Spring (
 Stiffness ( 1e6N/m 2e6N/m )
 Damping ( 1e6N/m 1e6N/m )
 Break ( 7e9N 7e9N )
 r0 ( 20cm 40cm )
 )
 Velocity (0.1m/s)

 )
 Coupling (
 Type ( Chain )
 Spring (
 Stiffness ( 1e6N/m 2e6N/m )
 Damping ( 1e6N/m 1e6N/m )
 Break ( 7e9N 7e9N )
 r0 ( 20cm 40cm )
 )
 Velocity (-0.1m/s)

 )


 FreightAnim ( 80097_BR_S_C4_2-6-4T_Cab.s 0.1 0.1 )

 Antislip ( 1 )
Adheasion ( 0.4 0.6 2 0 )
 DerailRailHeight ( 4cm )
 DerailRailForce ( 240kN )
 DerailBufferForce ( 400kN )
 WheelRadius ( 0.46m )
 NumWheels ( 6 )
 Friction (
 50N/m/s 1 -1mph 0 1
 5.1N/rad/s 1 -1rad/s 0 1 )

 

 BrakeEquipmentType( "Vacuum_brake, Handbrake, Auxilary_reservoir" )
 BrakeSystemType( "Vacuum_single_pipe" )
 MaxBrakeForce( 90kN )
 MaxHandbrakeForce( 80kN )
 NumberOfHandbrakeLeverSteps( 100 )
 MaxReleaseRate( 3 )
 MaxApplicationRate( 2 )
 MaxAuxilaryChargingRate( 10 )
 BrakeCylinderPressureForMaxBrakeBrakeForce( 21 ) 
 
 Sound ( "..\\..\\common.sound\\2cyl_generic\\2c-100d-eng01.sms" )

Lights ( 3

 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 )
 Cycle ( 0 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80ff9900 )
 Position ( 0 3.3 5.95 )
 Azimuth ( 0 0 0 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )
 
 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 0 )
 Unit ( 0 )
 )
 FadeIn ( 0.975 )
 FadeOut ( 0.975 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.80 -2.85 )
 Azimuth ( -90 -90 -90 )
 Transition ( 0 )
 Radius ( 1.3 )
 )
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.80 -2.85 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 1.3 )
 
 )
 )
 )

 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 0 )
 Unit ( 0 )
 )
 FadeIn ( 0.75 )
 FadeOut ( 0.75 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.80 -2.85 )
 Azimuth ( 45 45 45 )
 Transition ( 0 )
 Radius ( 1.35 )
 )
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.80 -2.85 )
 Azimuth ( 180 180 180 )
 Transition ( 0 )
 Radius ( 1.35 )
 
 )
 )
 )

 )
)

Engine ( #80105 
Effects (
 SteamSpecialEffects
 (
 StackFX
 (
 0 4.0 4.45
 0 1 0
 .1
 )

 CylindersFX
 (
 1 0.8817683 4.8
 0 -0.45 1.3
 0.2
 )
 CylindersFX
 (
 -1 0.8817683 4.8
 0 -0.45 1.3
 0.2
 )
 WhistleFX
 (
 0 3.8 -1.6
 0 1 0
 .1
 )
 SafetyValvesFX
 (
 0 3.8 -1.1
 0 1 0
 .2

 )
 )

)
 Wagon ( #80105 )
 IsTenderRequired( -1.0 )
 Type ( Steam )
 MaxPower ( 1000kW )
 MaxForce ( 25515lbf )
 MaxVelocity ( 80mph )
 WheelRadius ( 0.47m )
 Sanding ( 1e9mph )
 NumWheels ( 6 )
 BoilerLength ( 6.2m )
 BoilerVolume ( "160*(ft^3)" )
 BoilerEffectivity ( 1.26 )
 DraftingEffect ( 0.8 )
 BoilerResponsiveness ( 1.22 )
 CoalBurnage ( 3.6lb/hp/h )
 MaxBoilerOutput ( 32500lb/h )
 NumCylinders ( 2 )
 CylinderStroke ( 28in )
 CylinderDiameter ( 18in )
 CylinderVolume ( "12.8*(ft^3)" )
 CylinderEffectivity ( 1 )
 InjectorSizes ( 11mm 12mm )
 ExhaustLimit ( 36000lb/h )
 PrimingFactor ( 1 )
 BlastExponent ( 0.9 )
 MaxBoilerPressure ( 225psi )
 MaxFireMass ( 2500lb )
 IdealFireMass ( 1800lb )
 MaxWaterMass ( 4000lb ) 
 SafetyValvesSteamUsage ( 8000lb/h )
 ShovelCoalMass ( 1lb )
 SmokeCombustion ( 1 )
 MaxTenderCoalMass ( 7840lb )
 MaxTenderWaterMass ( 20000lb )

 
 InjectorTypes( 0 1 ) 
 SuperHeater ( 1.23 )
 SteamSmokeUnitsPerPoundOfFuel( 2 )
 SteamMaxSmokeUnitsReleaseRate( 10 )
 MaxSteamHeatingPressure( 80 )
 SafetyValvePressureDifference( 5 )
 SteamGaugeGlassHeight( 10 )
 BasicSteamUsage ( 1000lb/h )
 BasicCoalUsage ( 850lb/h )

 
 InjectorLimits1 ( 50psi 0.6 1 )
 InjectorLimits2 ( 60psi 0 1 )
 CylinderCocksPowerEfficiency ( 0.9 )
 SteamCylinderCocksOperation( Manual )

 VacuumBrakesSmallEjectorPowerRating( 3.5 )
 VacuumBrakesMinBoilerPressureMaxVacuum( 110 )
 VacuumBrakesSmallEjectorUsageRate( 500 )
 VacuumBrakesLargeEjectorUsageRate( 2400 )
 VacuumBrakesHasVacuumPump( 0 )

 TrainBrakesControllerMaxReleaseRate( 12 )
 TrainBrakesControllerMinSystemPressure( 0 )
 TrainBrakesControllerMaxSystemPressure( 21 )

 EngineBrakesControllerHasProportionalBrake( 1 )
 EngineBrakesProportionalBrakeLag( 0.9 )

 BrakesEngineBrakeType( "Vacuum_single_pipe" )
 BrakesTrainBrakeType( "Vacuum_single_pipe" )
 BrakesEngineControllers( "Hand, Train" )

 SteamSmallestCutoff( 8 )
 NumberOfDamperSteps( 4 )

 RegulatorValveType( Twin_port )
 RegulatorSecondValveStartPosition( 0.5 )
 RegulatorPilotValveExponent( 1.7 )
 RegulatorSecondValveExponent( 1.7 )
 RegulatorPilotValveFullOpenning( 0.3 )
 RegulatorMainValveInitialOpenning( 0.4 )

 SteamBlowerEffectExponent( 0.9 )
 SteamBlowerEfficiencyExponent( 1.1 )
 SteamBlowerMaxSteamUsageRate( 500 ) 
 SteamBlowerMaxProportionOfBlastEffect( 0.15 )

 SteamWaterScoopMinPickupSpeed( 25 ) 
 SteamWaterScoopMaxPickupSpeed( 60 ) 
 SteamWaterScoopResistance( 8500N )
 
 SteamWaterScoopMaxPickupRate( 1000 )
 
 SteamSmokeUnitsPerPoundOfFuel( 0.3 )

 
 

 EngineControllers (
 
 
 Regulator ( 0 1 0.025 0 
 NumNotches( 0 )
 )
 Cutoff ( -0.75 0.75 0.0075 0 
 NumNotches( 15
 Notch ( -0.75 0 Dummy )
 Notch ( -0.65 0 Dummy )
 Notch ( -0.55 0 Dummy )
 Notch ( -0.45 0 Dummy )
 Notch ( -0.35 0 Dummy )
 Notch ( -0.25 0 Dummy )
 Notch ( -0.15 0 Dummy )
 Notch ( 0.0 0 Dummy )
 Notch ( 0.15 0 Dummy )
 Notch ( 0.25 0 Dummy )
 Notch ( 0.35 0 Dummy )
 Notch ( 0.45 0 Dummy )
 Notch ( 0.55 0 Dummy )
 Notch ( 0.65 0 Dummy )
 Notch ( 0.75 0 Dummy )
 
 )
 )
 
 Brake_Train ( 0 1 0.0375 0.65
 NumNotches( 3
 Notch( 0 1 TrainBrakesControllerReleaseStart )
 Notch(0.01 1 TrainBrakesControllerRunningStart )
 Notch(0.2 1 TrainBrakesControllerApplyStart )
 )
 )
 Brake_Hand ( 0 1 0.0125 0 
 NumNotches( 0 )
 )
 FireDoor ( 0 1 0.1 0 
 NumNotches( 0 )
 )
 Sanding( 0 1 0 )
 Blower ( 0 1 0.025 0.2 
 NumNotches( 0 )
 )
 HeatingTap ( 0 1 0.025 0 
 NumNotches( 0 )
 )
 Shovel ( 0 1 0.1 0 
 NumNotches( 0 )
 )
 DampersFront ( 0 1 0.1 1 
 NumNotches( 0 )
 )
 DampersBack ( 0 1 0.1 0 
 NumNotches( 0 )
 )
 Injector1Steam ( 0 1 0 )
 Injector2Steam ( 0 1 0 )
 Injector1Water ( 0 1 0.1 0 
 NumNotches( 0 )
 )
 Injector2Water ( 0 1 0.1 0 
 NumNotches( 0 )
 )
 CylinderCocks ( 0 1 1 )
 Whistle ( 0 1 0 )
 WaterScoop ( 0 1 0 )
 SmallEjectorOrCompressor( 0 1 1 )
 Headlights( 0 1 0 )
 )

 comment( fire temp, fire mass, water mass, boiler pressure,
 water level, tender_water_mass, tender_coal_mass,
 smoke_quantity, fire_condition, coal quality )
 
 EngineVariables( 775 1250 3000 230 0.8 35000 100 350 1 1 )
 
 Name ( "#80105 BR Standard 4MT 2-6-4T" )
 Description (
 "80105 BR 4MT 2-6-4T"

 )
 EngineOperatingProcedures (
 "To move forward\n"+
 "1. Press the W key several times to move the Reverser to full Forward.\n"+
 "2. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "3. Press the D key to increase the Regulator setting.\n"+ 
 "4. As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+
 "To slow the train\n"+
 "1. Press the A key to move the Regulator to a lower setting.\n"+
 "2. Use the brakes to further reduce speed if desired.\n\n"+
 "To apply the train brakes\n"+
 "1. Press the ' (APOSTROPHE) key to apply the train brakes.\n"+
 "2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+
 "To release the train brakes\n"+
 "1. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+
 "To back up\n"+
 "1. Bring your train to a full stop.\n"+ 
 "2. Press the S key several times to move the Reverser to the full Reverse position.\n"+
 "4. Press the ; (SEMICOLON) key to release the brakes.\n"+
 "5. Slowly advance the regulator (D key).\n\n"+
 "To load and unload passengers\n"+
 "1. Stop at a station.\n"+
 "2. Press the ENTER key.\n"+
 "3. Wait for the \"permission to depart\" whistle.\n"+
 "TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
 "To couple to a car or locomotive\n"+
 "1. Coast into the unit at a very slow speed, about 2 mph.\n"+
 "TIP: To use the Coupling view, press the 6 key.\n"+
 "2. Press F9 to open the Train Operations window.\n"+
 "3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
 "4. Close the Train Operations window.\n\n"+
 "To uncouple from a car or locomotive\n"+
 "1. Press F9 to open the Train Operations window.\n"+
 "2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
 "3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
 "4. Close the Train Operations window.\n\n"+
 "Firing commands (Automatic Fireman OFF in Options screen)\n"+
 "To add coal to the firebox\n"+
 "1. Press the F key to open the Firebox door.\n"+
 "2. Press the R key to increase the shoveling rate.\n\n"+
 "To stop adding coal to the fire\n"+
 "1. Press SHIFT+R to decrease the shoveling rate.\n"+
 "2. Press SHIFT+F to close the firebox door.\n\n"+
 "To operate the blower\n"+
 "1. Press the N key to increase the blower.\n"+
 "2. Press SHIFT+N to decrease the blower.\n\n"+
 "To operate the dampers\n"+
 "1. Press the M key to open the dampers.\n"+
 "2. Press SHIFT+M to close the dampers.\n\n"+
 "To inject water into the boiler\n"+
 "1. Press the I key to turn on the steam to Injector 1.\n"+
 "(You can also press the O key to turn on the steam to Injector 2.)\n"+
 "2. Press the K key to increase the water flow to Injector 1.\n"+
 "(To increase the water flow to Injector 2, press the L key.)\n\n"+
 "To stop boiler water injection\n"+ 
 "1. Press the I key to turn off the steam to Injector 1.\n"+
 "2. Press the O key to turn off the steam to Injector 2."
 )
)